---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CurveNotEditable
source: html/4218097d-d65b-0d18-482e-aad5c9206c23.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurveFailures.CurveNotEditable Property

Lines created by massing or picking 3d path are not editable.

## Syntax (C#)
```csharp
public static FailureDefinitionId CurveNotEditable { get; }
```